*** generate index.html using ~pygmentize~ for generating the code snippets

Install ~pygments~ Python module and its command line ~pygmentize~.

#+BEGIN_SRC bash
python3 --version
#+END_SRC

#+RESULTS:
: Python 3.9.2

#+BEGIN_SRC bash
python3 -m venv .venv
source .venv/bin/activate
pip install Pygments
which pygmentize
#+END_SRC

gives you:

: /home/tony/work/projects/discreet-theme/.venv/bin/pygmentize

The file [[./dev/pygments/index.html]] has been generated using ~pygmentize~
command line evaluating the following ~elisp~ code:

#+BEGIN_SRC emacs-lisp
(setq pygm-cmd (concat default-directory ".venv/bin/pygmentize"))

(defun pygm (code lang)
  "Return an html string with CODE formatted with `pygmentize'
following LANG language."
  (let* ((id (sha1 (mapconcat #'number-to-string (current-time) "")))
         (tmpfile (concat "/tmp/pygmentize-" id))
         (cmd (concat pygm-cmd
                      " -f html"
                      " -l " lang
                      " " tmpfile)))
    (with-temp-file tmpfile (insert code))
    (shell-command-to-string cmd)))

(with-temp-file "dev/pygments/index.html"
  (insert
   (concat "<html><head><meta charset=\"UTF-8\"/>"
           "<style> h1,h2 {color:white;} </style>"
           ;; "<style> body {background:#121212;} h1,h2 {color:white;} </style>"
           "<link rel=\"stylesheet\" href=\"discreet-theme-pygments.css\">"
           "<title>discreet theme</title>"
           "</head>"
           "<body>"))
  (dolist (f (--filter (not (member it '("." "..")))
                       (directory-files "dev/fixtures")))
    (let ((code (with-temp-buffer
                  (insert-file-contents (concat "./dev/fixtures/" f))
                  (buffer-substring-no-properties (point-min) (point-max))))
          (lang (car (s-split "[.]" f))))
      (insert (pygm code lang))))
  (insert "</body>"))
#+END_SRC

